In [34]:
import pandas as pd
import numpy as np

In [35]:
tdf = pd.read_csv("titanic_cleaned.csv")
fdf = pd.read_csv("ticket_fares.csv")

In [36]:
pd.merge(tdf,fdf,on='Ticket')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare_x,Embarked,FamilySize,IsAlone,Fare_y
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S,1,0,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,1,0,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S,0,1,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S,1,0,53.1000
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S,1,0,53.1000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1588,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S,0,1,30.0000
1589,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21,1,2,W./C. 6607,23.4500,S,3,0,23.4500
1590,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,21,1,2,W./C. 6607,23.4500,S,3,0,23.4500
1591,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C,0,1,30.0000
1592,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,Q,0,1,7.7500

In [37]:
ageBins =[0,12,19,59,100]
ageLabels= ['Child','Young Adult','Adult','Senior']
tdf["AgeGroup"] = pd.cut(tdf["Age"],bins= ageBins,labels=ageLabels,right=True)

In [38]:
tdf.groupby(['Sex','AgeGroup'])['Survived'].mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_15824\1948554930.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tdf.groupby(['Sex','AgeGroup'])['Survived'].mean()

Sex     AgeGroup
female  Child          0.566667
        Young Adult    0.790698
        Adult          0.748936
        Senior         1.000000
male    Child          0.500000
        Young Adult    0.096154
        Adult          0.171674
        Senior         0.136364
Name: Survived, dtype: float64

In [39]:
with open("report.txt","w") as f:
    f.write("Hypothesis A\n")
    f.write("The numbers clearly show that women and children were given priority during the Titanic rescue. Most women survived, with survival rates between 74% to 100%, while only about 10% to 17%  men survived. Children also had better chances of survival, with around 50% to 57% were saved. ")

In [40]:
tdf.groupby("Pclass")["Survived"].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [41]:
fareLabels = ['Low','Medium','High','VeryHigh']
tdf["FareBin"] = pd.qcut(tdf["Fare"],q=4,labels=fareLabels)

In [42]:
tdf.groupby("FareBin")["Survived"].mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_15824\3335412592.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tdf.groupby("FareBin")["Survived"].mean()

FareBin
Low         0.197309
Medium      0.303571
High        0.454955
VeryHigh    0.581081
Name: Survived, dtype: float64

In [43]:
with open("report.txt","a") as f:
    f.write("\nHypothesis B\n")
    f.write("The data clearly shows that wealthier passengers had a higher chance of survival on the Titanic. Passengers in the lowest fare group had only about 19% survival, while those in the highest fare group had around 58%. This suggests that people who paid more, likely traveling in higher classes, were given better access to lifeboats and safety, showing a clear link between wealth and survival.")